tutorials/bladeMachines/DensityBasedTurbo/AxialMixerMRFCHTUnsteady/0.sav/mut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      mut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    inletRotor
    {
        type            calculated;
        value           uniform 0.1;
    }
    cyclic1
    {
        type            cyclicGgi;
    }
    cyclic2
    {
        type             cyclicGgi;
    }
    heat_transfer
    {
        type            mutWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0.1;
    }
    shroud
    {
        type            mutWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0.1;
    }
    cyclicStator1
    {
        type            cyclicGgi;
    }
    cyclicStator2
    {
        type            cyclicGgi;
    }
    outletRotor_ggi
    {
        type            overlapGgi;
    }
    inletStator_ggi
    {
        type            overlapGgi;
    }
    outlet
    {
        type            calculated;
    }
    wall
    {
        type            mutWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0.1;
    }
}

// ************************************************************************* //
