tutorials/bladeMachines/DensityBasedTurbo/AxialMixerMRFCHTUnsteady/0.sav/solid/K
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      K;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -3 -1 0 0 0];

internalField   uniform 150;

boundaryField
{

 welle_front
    {
        type           zeroGradient;
    }
    welle_back
    {
        type           zeroGradient;
    }
    welle_adiabat
    {
        type           zeroGradient;
    }
    blade_ht
    {
        type           zeroGradient;
    }
    cyclic_hub1
    {
        type            cyclicGgi;
    }
    cyclic_hub2
    {
        type            cyclicGgi;
    }

}

// ************************************************************************* //
