tutorials/bladeMachines/DensityBasedTurbo/AxialMixerMRFCHTUnsteady/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//- Keep owner and neighbour on same processor for faces in zones:
// preserveFaceZones ( interface1_faces interface2_faces );

//- Keep owner and neighbour on same processor for faces in patches:
// preservePatches ( interface1 interface2 );

globalFaceZones
(
    cyclic1_faces
    cyclic2_faces
    inletStator_faces
    outletRotor_faces
    cyclicStator1_faces
    cyclicStator2_faces
);  // Those are the names of the face zones created previously

numberOfSubdomains 2;        // The problem will be decomposed in 4 different processors

method          scotch;
// method          metis;

simpleCoeffs
{
     n               (2 2 1);
     delta           0.001;
}

metisCoeffs
{
/*
    processorWeights
    (
        1
        1
        1
        1
    );
*/
}

scotchCoeffs
{
    //processorWeights
    //(
    //    1
    //    1
    //    1
    //    1
    //);
    //writeGraph  true;
    //strategy "b";
}

distributed     no;

roots
(
);


// ************************************************************************* //
